## prod
#### Terraform Initialization :gear: `success`
#### Terraform Plan :book: `success`

<details><summary>Show Plan</summary>

```terraform
module.GKE.module.vpc.google_compute_address.nat: Refreshing state... [id=projects/guitarnetes1/regions/us-east1/addresses/cluster-nat]
module.GKE.module.vpc.google_compute_network.my_vpc: Refreshing state... [id=projects/guitarnetes1/global/networks/gke-vpc-1]
module.GKE.module.vpc.google_compute_router.router: Refreshing state... [id=projects/guitarnetes1/regions/us-east1/routers/router]
module.GKE.module.subnet.google_compute_subnetwork.private_subnet: Refreshing state... [id=projects/guitarnetes1/regions/us-east1/subnetworks/private-subnet]
module.GKE.google_container_cluster.primary: Refreshing state... [id=projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke2]
module.GKE.module.vpc.google_compute_router_nat.nat: Refreshing state... [id=guitarnetes1/us-east1/router/cluster-nat]
module.GKE.module.node_pool.google_container_node_pool.primary_nodes: Refreshing state... [id=projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke2/nodePools/node-pool]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.GKE.google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ cluster_ipv4_cidr           = "10.88.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      ~ default_max_pods_per_node   = 110 -> (known after apply)
      ~ deletion_protection         = true -> false
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "35.237.23.136" -> (known after apply)
      ~ id                          = "projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke2" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.27.3-gke.100" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
      ~ name                        = "guitarnetes-gke2" -> "guitarnetes-gke" # forces replacement
      ~ network                     = "projects/guitarnetes1/global/networks/gke-vpc-1" -> "gke-vpc-1"
      ~ networking_mode             = "VPC_NATIVE" -> (known after apply)
      ~ node_locations              = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> (known after apply)
      ~ node_version                = "1.27.4-gke.900" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "guitarnetes1" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke2" -> (known after apply)
      ~ services_ipv4_cidr          = "10.92.0.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/guitarnetes1/regions/us-east1/subnetworks/private-subnet" -> "private-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)
        # (7 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - ip_allocation_policy {
          - cluster_ipv4_cidr_block       = "10.88.0.0/14" -> null
          - cluster_secondary_range_name  = "gke-guitarnetes-gke2-pods-3208aedb" -> null
          - services_ipv4_cidr_block      = "10.92.0.0/20" -> null
          - services_secondary_range_name = "gke-guitarnetes-gke2-services-3208aedb" -> null
          - stack_type                    = "IPV4" -> null

          - pod_cidr_overprovision_config {
              - disabled = false -> null
            }
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      - master_auth {
          - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQVBCMjJWbU9SWEpDNDFTWU1KMlpuRWN3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa1lqWXhOMlEyWWpVdFl6VXlPUzAwTm1GaUxXRTRZbUV0TW1FMk1UUmlPR1k1TW1JdwpNQ0FYRFRJek1UQXlPVEV5TURFeE4xb1lEekl3TlRNeE1ESXhNVE13TVRFM1dqQXZNUzB3S3dZRFZRUURFeVJpCk5qRTNaRFppTlMxak5USTVMVFEyWVdJdFlUaGlZUzB5WVRZeE5HSTRaamt5WWpBd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FDcUk2bFcvQ3NCaGRiUkJEVy9rOWt2cktWRStYeWJZR0lCbm1QbQovOS94ajNTMEx5NVYxY2grU25FdEdsRi9qS3BqTU1HTHNQTzJFcmUwLy9MS1pYSWVHQmdXNnAvNmtlYitXajFkCkhIUXhaZENaa2RSMWZldjI0WjR3KzJ4dUJ4Y1M0NWhCc1pYVDFqbm9lUzFZeElGeWdoR2REazRlQWlPZWRYMG0KdUY0d3FYS1RVaEhlYkVSdEZ3YTUvTmV4V1IxZUI0TEhJUGRieGxOcmhXNElUdEpDRnhiU0FhSFJVbGxIV3ZxLwpHMVE3a3NzL1hwTERwNUFncjFZazd3WXJ2S0NMaE9ZUHZuNlY4QmxrMEZXVWFkYmIyazg0QTdDQ2l6VGVtTDdDCi9oaGFhRWcvWHljeTNWNGVDVnp4QllFRDRRTEtEV1hkeDI3eFgwYkhhR0hBUzBSYlJlMmRXMjQ1N1NSU1FleFMKSzN5V3lMaVV6T3dxUXhWYThKUEN5VjZCSHZnNU9Za2RBSEQ2bUVKNHlualhPS2VxbWVXeWJpVXlCeWFJV3paZQpYOWo2cnR2L0VNcUNYQWxqcnMwNVl0anN1cG1PaDA2MkozdERCVzJaRHFjMXUwZHZBNElkVEJGUzdhaFFzMU91CjJFYzNGMTJxNnBVekpnUXNKYnZDWWFWcGdoc0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGSU5SVmpJN0FGSFJiQlJGMW81QnlHQUszd2hSTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQ3BsdytMclBlVFg1emZVZU1FTEIyOGxBMEhuTzlBcVpzYjNZcjYyYlZNCjJjRU53YXB0akFvVWZDd0VMOGZ5M2haQ1phVXhSTVlFcW1DZTNGQXlmK1NoNjk0NkZ6VTBraWVZZTRnQ2F3MHMKaEhEV2lZL3RhY0dWdlFkNk9yNE5NWkRUQjU1clV3Qld3UVAxK0hUWVhJMHZYMUNPdXlEeFJILzRCOFJFaFMySApHdUlCTGgzY2d6ZlUrOEpLZFdkeEx5OThSZXpqZklnaUZRVmxEbWhycWdLdFNFemxkREFqS0UyaHJNMEtRemhLCjRGZk1yV2tyOFYyUGVHOGNhYWcxVDV6QmFEbzBOWXZ6YkNCK2Izc05PU2diRXdmMWI0NWFDbUVGd0xwSlAzYkMKQmMxUGljQUgrL3FoWmV5aU5TdGxGUzJWaXdlLzJSZzBkQnVlR04yNDdxQlAwZWdRR1IzbFRMcklYU0xLaDVkVQpxRUtISSs4ZWQ2S1RrSUxLSHliS283aTNWRUV2NjZydHFNVGV5VC9RYXFvUnJNZE1zRDkyRWY1NlZ0anJkNDljCjF2MGVtd3lQREJGamRCMWx5VnQ4UjdMSmUvRC9YZFVhNy9WK0QyMFVkRnlRc1pkMkNyZElIK25vY1R0MG1IZU4KUHZMSzIrRTg5cmRtWnpDcm9oelIwRms9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

          - client_certificate_config {
              - issue_client_certificate = false -> null
            }
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null

          - advanced_datapath_observability_config {
              - enable_metrics = false -> null
              - relay_mode     = "DISABLED" -> null
            }

          - managed_prometheus {
              - enabled = true -> null
            }
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      - node_config {
          - disk_size_gb      = 100 -> null
          - disk_type         = "pd-balanced" -> null
          - effective_taints  = [] -> null
          - guest_accelerator = [] -> null
          - image_type        = "COS_CONTAINERD" -> null
          - labels            = {
              - "env" = "guitarnetes1"
            } -> null
          - local_ssd_count   = 0 -> null
          - logging_variant   = "DEFAULT" -> null
          - machine_type      = "n1-standard-1" -> null
          - metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> null
          - preemptible       = false -> null
          - resource_labels   = {} -> null
          - service_account   = "default" -> null
          - spot              = false -> null
          - tags              = [
              - "gke-node",
              - "guitarnetes1-gke",
            ] -> null

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - node_pool {
          - initial_node_count          = 1 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-d/instanceGroupManagers/gke-guitarnetes-gke2-node-pool-5513490a-grp",
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-b/instanceGroupManagers/gke-guitarnetes-gke2-node-pool-a40aa26f-grp",
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-c/instanceGroupManagers/gke-guitarnetes-gke2-node-pool-3e090087-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-d/instanceGroups/gke-guitarnetes-gke2-node-pool-5513490a-grp",
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-b/instanceGroups/gke-guitarnetes-gke2-node-pool-a40aa26f-grp",
              - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-c/instanceGroups/gke-guitarnetes-gke2-node-pool-3e090087-grp",
            ] -> null
          - max_pods_per_node           = 110 -> null
          - name                        = "node-pool" -> null
          - node_count                  = 1 -> null
          - node_locations              = [
              - "us-east1-b",
              - "us-east1-c",
              - "us-east1-d",
            ] -> null
          - version                     = "1.27.4-gke.900" -> null

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
              - pod_ipv4_cidr_block  = "10.88.0.0/14" -> null
              - pod_range            = "gke-guitarnetes-gke2-pods-3208aedb" -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-balanced" -> null
              - effective_taints  = [] -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {
                  - "env" = "guitarnetes1"
                } -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "n1-standard-1" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/logging.write",
                  - "https://www.googleapis.com/auth/monitoring",
                ] -> null
              - preemptible       = false -> null
              - resource_labels   = {} -> null
              - service_account   = "default" -> null
              - spot              = false -> null
              - tags              = [
                  - "gke-node",
                  - "guitarnetes1-gke",
                ] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.0.1.9" -> null
          - public_endpoint         = "35.237.23.136" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "BASIC" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # module.GKE.module.node_pool.data.google_container_engine_versions.gke_version will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "gke_version" {
      + default_cluster_version         = (known after apply)
      + id                              = (known after apply)
      + latest_master_version           = (known after apply)
      + latest_node_version             = (known after apply)
      + location                        = "us-east1"
      + release_channel_default_version = (known after apply)
      + release_channel_latest_version  = (known after apply)
      + valid_master_versions           = (known after apply)
      + valid_node_versions             = (known after apply)
      + version_prefix                  = "1.27."
    }

  # module.GKE.module.node_pool.google_container_node_pool.primary_nodes must be replaced
-/+ resource "google_container_node_pool" "primary_nodes" {
      ~ cluster                     = "guitarnetes-gke2" -> "guitarnetes-gke" # forces replacement
      ~ id                          = "projects/guitarnetes1/locations/us-east1/clusters/guitarnetes-gke2/nodePools/node-pool" -> (known after apply)
      ~ initial_node_count          = 1 -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-d/instanceGroupManagers/gke-guitarnetes-gke2-node-pool-5513490a-grp",
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-b/instanceGroupManagers/gke-guitarnetes-gke2-node-pool-a40aa26f-grp",
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-c/instanceGroupManagers/gke-guitarnetes-gke2-node-pool-3e090087-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-d/instanceGroups/gke-guitarnetes-gke2-node-pool-5513490a-grp",
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-b/instanceGroups/gke-guitarnetes-gke2-node-pool-a40aa26f-grp",
          - "https://www.googleapis.com/compute/v1/projects/guitarnetes1/zones/us-east1-c/instanceGroups/gke-guitarnetes-gke2-node-pool-3e090087-grp",
        ] -> (known after apply)
      ~ max_pods_per_node           = 110 -> (known after apply)
        name                        = "node-pool"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 1 -> 2
      ~ node_locations              = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.27.4-gke.900" -> (known after apply)
        # (2 unchanged attributes hidden)

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - network_config {
          - create_pod_range     = false -> null
          - enable_private_nodes = false -> null
          - pod_ipv4_cidr_block  = "10.88.0.0/14" -> null
          - pod_range            = "gke-guitarnetes-gke2-pods-3208aedb" -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> (known after apply)
          ~ disk_type         = "pd-balanced" -> (known after apply)
          ~ effective_taints  = [] -> (known after apply)
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ logging_variant   = "DEFAULT" -> (known after apply)
          + min_cpu_platform  = (known after apply)
          - resource_labels   = {} -> null
          ~ service_account   = "default" -> (known after apply)
            tags              = [
                "gke-node",
                "guitarnetes1-gke",
            ]
            # (6 unchanged attributes hidden)

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

Pusher: @Yanirw, Action: `pull_request`

Comment to apply these changes to the current environment